using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;


namespace HebrewDate
{
    public static class Dictioneries
    {
        // Dictionary for days in the month
        public static Dictionary<string, string> daysInMonthDic = new Dictionary<string, string>()
        {
            {"1",  "יום אחד לירח"},
            {"2",  "שני ימים לירח"},
            {"3",  "שלשה ימים לירח"},
            {"4",  "ארבעה ימים לירח"},
            {"5",  "חמשה ימים לירח"},
            {"6",  "ששה ימים לירח"},
            {"7",  "שבעה ימים לירח"},
            {"8",  "שמנה ימים לירח"},
            {"9",  "תשעה ימים לירח"},
            {"10",  "עשרה ימים לירח"},
            {"11",  "אחד עשר יום לירח"},
            {"12",  "שנים עשר יום לירח"},
            {"13",  "שלשה עשר יום לירח"},
            {"14",  "ארבעה עשר יום לירח"},
            {"15",  "חמשה עשר יום לירח"},
            {"16",  "ששה עשר יום לירח"},
            {"17",  "שבעה עשר יום לירח"},
            {"18",  "שמנה עשר יום לירח"},
            {"19",  "תשעה עשר יום לירח"},
            {"20",  "עשרים יום לירח"},
            {"21",  "אחד ועשרים יום לירח"},
            {"22",  "שנים ועשרים יום לירח"},
            {"23",  "שלשה ועשרים יום לירח"},
            {"24",  "ארבעה ועשרים יום לירח"},
            {"25",  "חמשה ועשרים יום לירח"},
            {"26",  "ששה ועשרים יום לירח"},
            {"27",  "שבעה ועשרים יום לירח"},
            {"28",  "שמנה ועשרים יום לירח"},
            {"29",  "תשעה ועשרים יום לירח"},
            {"30", "יום שלושים לחודש" }
        };

        // Dictionary for days in the week
        public static Dictionary<string, string> daysInWeekDic = new Dictionary<string, string>()
        {
            {"ראשון", "באחד בשבת" },
            {"שני", "בשני בשבת" },
            {"שלישי", "בשלישי בשבת" },
            {"רביעי", "ברביעי בשבת" },
            {"חמישי", "בחמישי בשבת" },
            {"ששי", "בששי בשבת" }
        };

        // Dictionary for years
        public static Dictionary<string, string> yearsDic = new Dictionary<string, string>()
        {
            {"תשפ\"ד", "חמשת אלפים ושבע מאות ושמנים וארבע לבריאת העולם"},
            {"תשפ\"ה", "חמשת אלפים ושבע מאות ושמנים וחמש לבריאת העולם"},
            {"תשפ\"ו", "חמשת אלפים ושבע מאות ושמנים ושש לבריאת העולם"},
            {"שפ\"ז", "חמשת אלפים ושבע מאות ושמנים ושבע לבריאת העולם"},
            {"תשפ\"ח", "חמשת אלפים ושבע מאות ושמנים ושמנה לבריאת העולם"},
            {"תשפ\"ט", "חמשת אלפים ושבע מאות ושמנים ותשע לבריאת העולם"},
            {"תש\"צ", "חמשת אלפים ושבע מאות ותשעים לבריאת העולם"},
            {"תשצ\"א", "חמשת אלפים ושבע מאות ותשעים ואחת לבריאת העולם"},
            {"תשצ\"ב", "חמשת אלפים ושבע מאות ותשעים ושניים לבריאת העולם"},
            {"תשצ\"ג", "חמשת אלפים ושבע מאות ותשעים ושלש לבריאת העולם"}
        };

        // Dictionary for months
        public static Dictionary<string, string> monthDic = new Dictionary<string, string>()
        {
            {"תשרי", "תשרי"},
            {"מרחשון", "מרחשון" },
            {"כסלו", "כסלו" },
            {"טבת", "טבת" },
            {"שבט", "שבט" },
            {"אדר", "אדר" },
            {"אדר הראשון", "אדר הראשון" },
            {"אדר השני", "אדר השני" },
            {"ניסן", "ניסן" },
            {"אייר", "אייר" },
            {"סיון", "סיון" },
            {"תמוז", "תמוז" },
            {"אב", "אב" },
            {"אלול", "אלול" }
        };
    }
}
